{"weightsManifest": [{"paths": ["group1-shard1of23.bin", "group1-shard2of23.bin", "group1-shard3of23.bin", "group1-shard4of23.bin", "group1-shard5of23.bin", "group1-shard6of23.bin", "group1-shard7of23.bin", "group1-shard8of23.bin", "group1-shard9of23.bin", "group1-shard10of23.bin", "group1-shard11of23.bin", "group1-shard12of23.bin", "group1-shard13of23.bin", "group1-shard14of23.bin", "group1-shard15of23.bin", "group1-shard16of23.bin", "group1-shard17of23.bin", "group1-shard18of23.bin", "group1-shard19of23.bin", "group1-shard20of23.bin", "group1-shard21of23.bin", "group1-shard22of23.bin", "group1-shard23of23.bin"], "weights": [{"dtype": "float32", "shape": [1, 1, 512, 2048], "name": "module/resnet_v2_50/block4/unit_1/bottleneck_v2/conv3/weights"}, {"dtype": "float32", "shape": [2048], "name": "module/resnet_v2_50/block4/unit_1/bottleneck_v2/conv3/biases"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "module/resnet_v2_50/block3/unit_6/bottleneck_v2/conv3/weights"}, {"dtype": "float32", "shape": [1024], "name": "module/resnet_v2_50/block3/unit_6/bottleneck_v2/conv3/biases"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "module/resnet_v2_50/block3/unit_1/bottleneck_v2/conv3/weights"}, {"dtype": "float32", "shape": [1024], "name": "module/resnet_v2_50/block3/unit_1/bottleneck_v2/conv3/biases"}, {"dtype": "float32", "shape": [1, 1, 128, 512], "name": "module/resnet_v2_50/block2/unit_4/bottleneck_v2/conv3/weights"}, {"dtype": "float32", "shape": [512], "name": "module/resnet_v2_50/block2/unit_4/bottleneck_v2/conv3/biases"}, {"dtype": "float32", "shape": [1, 1, 128, 512], "name": "module/resnet_v2_50/block2/unit_1/bottleneck_v2/conv3/weights"}, {"dtype": "float32", "shape": [512], "name": "module/resnet_v2_50/block2/unit_1/bottleneck_v2/conv3/biases"}, {"dtype": "int32", "shape": [4, 2], "name": "module_apply_default/resnet_v2_50/block1/unit_3/bottleneck_v2/Pad/paddings"}, {"dtype": "float32", "shape": [1, 1, 64, 256], "name": "module/resnet_v2_50/block1/unit_3/bottleneck_v2/conv3/weights"}, {"dtype": "float32", "shape": [256], "name": "module/resnet_v2_50/block1/unit_3/bottleneck_v2/conv3/biases"}, {"dtype": "float32", "shape": [1, 1, 64, 256], "name": "module/resnet_v2_50/block1/unit_1/bottleneck_v2/conv3/weights"}, {"dtype": "float32", "shape": [256], "name": "module/resnet_v2_50/block1/unit_1/bottleneck_v2/conv3/biases"}, {"dtype": "float32", "shape": [], "name": "module_apply_default/hub_input/Mul/y"}, {"dtype": "float32", "shape": [], "name": "module_apply_default/hub_input/Sub/y"}, {"dtype": "int32", "shape": [4, 2], "name": "module_apply_default/resnet_v2_50/Pad/paddings"}, {"dtype": "float32", "shape": [7, 7, 3, 64], "name": "module/resnet_v2_50/conv1/weights"}, {"dtype": "float32", "shape": [64], "name": "module/resnet_v2_50/conv1/biases"}, {"dtype": "float32", "shape": [1, 1, 64, 256], "name": "module/resnet_v2_50/block1/unit_1/bottleneck_v2/shortcut/weights"}, {"dtype": "float32", "shape": [256], "name": "module/resnet_v2_50/block1/unit_1/bottleneck_v2/shortcut/biases"}, {"dtype": "float32", "shape": [1, 1, 64, 256], "name": "module/resnet_v2_50/block1/unit_2/bottleneck_v2/conv3/weights"}, {"dtype": "float32", "shape": [256], "name": "module/resnet_v2_50/block1/unit_2/bottleneck_v2/conv3/biases"}, {"dtype": "float32", "shape": [1, 1, 256, 512], "name": "module/resnet_v2_50/block2/unit_1/bottleneck_v2/shortcut/weights"}, {"dtype": "float32", "shape": [512], "name": "module/resnet_v2_50/block2/unit_1/bottleneck_v2/shortcut/biases"}, {"dtype": "float32", "shape": [1, 1, 128, 512], "name": "module/resnet_v2_50/block2/unit_2/bottleneck_v2/conv3/weights"}, {"dtype": "float32", "shape": [512], "name": "module/resnet_v2_50/block2/unit_2/bottleneck_v2/conv3/biases"}, {"dtype": "float32", "shape": [1, 1, 128, 512], "name": "module/resnet_v2_50/block2/unit_3/bottleneck_v2/conv3/weights"}, {"dtype": "float32", "shape": [512], "name": "module/resnet_v2_50/block2/unit_3/bottleneck_v2/conv3/biases"}, {"dtype": "float32", "shape": [1, 1, 512, 1024], "name": "module/resnet_v2_50/block3/unit_1/bottleneck_v2/shortcut/weights"}, {"dtype": "float32", "shape": [1024], "name": "module/resnet_v2_50/block3/unit_1/bottleneck_v2/shortcut/biases"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "module/resnet_v2_50/block3/unit_2/bottleneck_v2/conv3/weights"}, {"dtype": "float32", "shape": [1024], "name": "module/resnet_v2_50/block3/unit_2/bottleneck_v2/conv3/biases"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "module/resnet_v2_50/block3/unit_3/bottleneck_v2/conv3/weights"}, {"dtype": "float32", "shape": [1024], "name": "module/resnet_v2_50/block3/unit_3/bottleneck_v2/conv3/biases"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "module/resnet_v2_50/block3/unit_4/bottleneck_v2/conv3/weights"}, {"dtype": "float32", "shape": [1024], "name": "module/resnet_v2_50/block3/unit_4/bottleneck_v2/conv3/biases"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "module/resnet_v2_50/block3/unit_5/bottleneck_v2/conv3/weights"}, {"dtype": "float32", "shape": [1024], "name": "module/resnet_v2_50/block3/unit_5/bottleneck_v2/conv3/biases"}, {"dtype": "float32", "shape": [1, 1, 1024, 2048], "name": "module/resnet_v2_50/block4/unit_1/bottleneck_v2/shortcut/weights"}, {"dtype": "float32", "shape": [2048], "name": "module/resnet_v2_50/block4/unit_1/bottleneck_v2/shortcut/biases"}, {"dtype": "float32", "shape": [1, 1, 512, 2048], "name": "module/resnet_v2_50/block4/unit_2/bottleneck_v2/conv3/weights"}, {"dtype": "float32", "shape": [2048], "name": "module/resnet_v2_50/block4/unit_2/bottleneck_v2/conv3/biases"}, {"dtype": "float32", "shape": [1, 1, 512, 2048], "name": "module/resnet_v2_50/block4/unit_3/bottleneck_v2/conv3/weights"}, {"dtype": "float32", "shape": [2048], "name": "module/resnet_v2_50/block4/unit_3/bottleneck_v2/conv3/biases"}, {"dtype": "int32", "shape": [2], "name": "module_apply_default/resnet_v2_50/pool5/reduction_indices"}, {"dtype": "float32", "shape": [1, 1, 64, 64], "name": "module/resnet_v2_50/block1/unit_1/bottleneck_v2/conv1/weights"}, {"dtype": "float32", "shape": [64], "name": "module_apply_default/resnet_v2_50/block1/unit_1/bottleneck_v2/conv1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 64, 64], "name": "module/resnet_v2_50/block1/unit_1/bottleneck_v2/conv2/weights"}, {"dtype": "float32", "shape": [64], "name": "module_apply_default/resnet_v2_50/block1/unit_1/bottleneck_v2/conv2/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 256, 64], "name": "module/resnet_v2_50/block1/unit_2/bottleneck_v2/conv1/weights"}, {"dtype": "float32", "shape": [64], "name": "module_apply_default/resnet_v2_50/block1/unit_2/bottleneck_v2/conv1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 64, 64], "name": "module/resnet_v2_50/block1/unit_2/bottleneck_v2/conv2/weights"}, {"dtype": "float32", "shape": [64], "name": "module_apply_default/resnet_v2_50/block1/unit_2/bottleneck_v2/conv2/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 256, 64], "name": "module/resnet_v2_50/block1/unit_3/bottleneck_v2/conv1/weights"}, {"dtype": "float32", "shape": [64], "name": "module_apply_default/resnet_v2_50/block1/unit_3/bottleneck_v2/conv1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 64, 64], "name": "module/resnet_v2_50/block1/unit_3/bottleneck_v2/conv2/weights"}, {"dtype": "float32", "shape": [64], "name": "module_apply_default/resnet_v2_50/block1/unit_3/bottleneck_v2/conv2/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 256, 128], "name": "module/resnet_v2_50/block2/unit_1/bottleneck_v2/conv1/weights"}, {"dtype": "float32", "shape": [128], "name": "module_apply_default/resnet_v2_50/block2/unit_1/bottleneck_v2/conv1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "name": "module/resnet_v2_50/block2/unit_1/bottleneck_v2/conv2/weights"}, {"dtype": "float32", "shape": [128], "name": "module_apply_default/resnet_v2_50/block2/unit_1/bottleneck_v2/conv2/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 512, 128], "name": "module/resnet_v2_50/block2/unit_2/bottleneck_v2/conv1/weights"}, {"dtype": "float32", "shape": [128], "name": "module_apply_default/resnet_v2_50/block2/unit_2/bottleneck_v2/conv1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "name": "module/resnet_v2_50/block2/unit_2/bottleneck_v2/conv2/weights"}, {"dtype": "float32", "shape": [128], "name": "module_apply_default/resnet_v2_50/block2/unit_2/bottleneck_v2/conv2/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 512, 128], "name": "module/resnet_v2_50/block2/unit_3/bottleneck_v2/conv1/weights"}, {"dtype": "float32", "shape": [128], "name": "module_apply_default/resnet_v2_50/block2/unit_3/bottleneck_v2/conv1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "name": "module/resnet_v2_50/block2/unit_3/bottleneck_v2/conv2/weights"}, {"dtype": "float32", "shape": [128], "name": "module_apply_default/resnet_v2_50/block2/unit_3/bottleneck_v2/conv2/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 512, 128], "name": "module/resnet_v2_50/block2/unit_4/bottleneck_v2/conv1/weights"}, {"dtype": "float32", "shape": [128], "name": "module_apply_default/resnet_v2_50/block2/unit_4/bottleneck_v2/conv1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "name": "module/resnet_v2_50/block2/unit_4/bottleneck_v2/conv2/weights"}, {"dtype": "float32", "shape": [128], "name": "module_apply_default/resnet_v2_50/block2/unit_4/bottleneck_v2/conv2/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 512, 256], "name": "module/resnet_v2_50/block3/unit_1/bottleneck_v2/conv1/weights"}, {"dtype": "float32", "shape": [256], "name": "module_apply_default/resnet_v2_50/block3/unit_1/bottleneck_v2/conv1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "module/resnet_v2_50/block3/unit_1/bottleneck_v2/conv2/weights"}, {"dtype": "float32", "shape": [256], "name": "module_apply_default/resnet_v2_50/block3/unit_1/bottleneck_v2/conv2/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "module/resnet_v2_50/block3/unit_2/bottleneck_v2/conv1/weights"}, {"dtype": "float32", "shape": [256], "name": "module_apply_default/resnet_v2_50/block3/unit_2/bottleneck_v2/conv1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "module/resnet_v2_50/block3/unit_2/bottleneck_v2/conv2/weights"}, {"dtype": "float32", "shape": [256], "name": "module_apply_default/resnet_v2_50/block3/unit_2/bottleneck_v2/conv2/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "module/resnet_v2_50/block3/unit_3/bottleneck_v2/conv1/weights"}, {"dtype": "float32", "shape": [256], "name": "module_apply_default/resnet_v2_50/block3/unit_3/bottleneck_v2/conv1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "module/resnet_v2_50/block3/unit_3/bottleneck_v2/conv2/weights"}, {"dtype": "float32", "shape": [256], "name": "module_apply_default/resnet_v2_50/block3/unit_3/bottleneck_v2/conv2/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "module/resnet_v2_50/block3/unit_4/bottleneck_v2/conv1/weights"}, {"dtype": "float32", "shape": [256], "name": "module_apply_default/resnet_v2_50/block3/unit_4/bottleneck_v2/conv1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "module/resnet_v2_50/block3/unit_4/bottleneck_v2/conv2/weights"}, {"dtype": "float32", "shape": [256], "name": "module_apply_default/resnet_v2_50/block3/unit_4/bottleneck_v2/conv2/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "module/resnet_v2_50/block3/unit_5/bottleneck_v2/conv1/weights"}, {"dtype": "float32", "shape": [256], "name": "module_apply_default/resnet_v2_50/block3/unit_5/bottleneck_v2/conv1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "module/resnet_v2_50/block3/unit_5/bottleneck_v2/conv2/weights"}, {"dtype": "float32", "shape": [256], "name": "module_apply_default/resnet_v2_50/block3/unit_5/bottleneck_v2/conv2/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "module/resnet_v2_50/block3/unit_6/bottleneck_v2/conv1/weights"}, {"dtype": "float32", "shape": [256], "name": "module_apply_default/resnet_v2_50/block3/unit_6/bottleneck_v2/conv1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "module/resnet_v2_50/block3/unit_6/bottleneck_v2/conv2/weights"}, {"dtype": "float32", "shape": [256], "name": "module_apply_default/resnet_v2_50/block3/unit_6/bottleneck_v2/conv2/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 1024, 512], "name": "module/resnet_v2_50/block4/unit_1/bottleneck_v2/conv1/weights"}, {"dtype": "float32", "shape": [512], "name": "module_apply_default/resnet_v2_50/block4/unit_1/bottleneck_v2/conv1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "module/resnet_v2_50/block4/unit_1/bottleneck_v2/conv2/weights"}, {"dtype": "float32", "shape": [512], "name": "module_apply_default/resnet_v2_50/block4/unit_1/bottleneck_v2/conv2/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 2048, 512], "name": "module/resnet_v2_50/block4/unit_2/bottleneck_v2/conv1/weights"}, {"dtype": "float32", "shape": [512], "name": "module_apply_default/resnet_v2_50/block4/unit_2/bottleneck_v2/conv1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "module/resnet_v2_50/block4/unit_2/bottleneck_v2/conv2/weights"}, {"dtype": "float32", "shape": [512], "name": "module_apply_default/resnet_v2_50/block4/unit_2/bottleneck_v2/conv2/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 2048, 512], "name": "module/resnet_v2_50/block4/unit_3/bottleneck_v2/conv1/weights"}, {"dtype": "float32", "shape": [512], "name": "module_apply_default/resnet_v2_50/block4/unit_3/bottleneck_v2/conv1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "module/resnet_v2_50/block4/unit_3/bottleneck_v2/conv2/weights"}, {"dtype": "float32", "shape": [512], "name": "module_apply_default/resnet_v2_50/block4/unit_3/bottleneck_v2/conv2/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [64], "name": "module_apply_default/resnet_v2_50/block1/unit_1/bottleneck_v2/preact/FusedBatchNorm/Offset"}, {"dtype": "float32", "shape": [64], "name": "module_apply_default/resnet_v2_50/block1/unit_1/bottleneck_v2/preact/FusedBatchNorm/Scaled"}, {"dtype": "float32", "shape": [256], "name": "module_apply_default/resnet_v2_50/block1/unit_2/bottleneck_v2/preact/FusedBatchNorm/Offset"}, {"dtype": "float32", "shape": [256], "name": "module_apply_default/resnet_v2_50/block1/unit_2/bottleneck_v2/preact/FusedBatchNorm/Scaled"}, {"dtype": "float32", "shape": [256], "name": "module_apply_default/resnet_v2_50/block1/unit_3/bottleneck_v2/preact/FusedBatchNorm/Offset"}, {"dtype": "float32", "shape": [256], "name": "module_apply_default/resnet_v2_50/block1/unit_3/bottleneck_v2/preact/FusedBatchNorm/Scaled"}, {"dtype": "float32", "shape": [256], "name": "module_apply_default/resnet_v2_50/block2/unit_1/bottleneck_v2/preact/FusedBatchNorm/Offset"}, {"dtype": "float32", "shape": [256], "name": "module_apply_default/resnet_v2_50/block2/unit_1/bottleneck_v2/preact/FusedBatchNorm/Scaled"}, {"dtype": "float32", "shape": [512], "name": "module_apply_default/resnet_v2_50/block2/unit_2/bottleneck_v2/preact/FusedBatchNorm/Offset"}, {"dtype": "float32", "shape": [512], "name": "module_apply_default/resnet_v2_50/block2/unit_2/bottleneck_v2/preact/FusedBatchNorm/Scaled"}, {"dtype": "float32", "shape": [512], "name": "module_apply_default/resnet_v2_50/block2/unit_3/bottleneck_v2/preact/FusedBatchNorm/Offset"}, {"dtype": "float32", "shape": [512], "name": "module_apply_default/resnet_v2_50/block2/unit_3/bottleneck_v2/preact/FusedBatchNorm/Scaled"}, {"dtype": "float32", "shape": [512], "name": "module_apply_default/resnet_v2_50/block2/unit_4/bottleneck_v2/preact/FusedBatchNorm/Offset"}, {"dtype": "float32", "shape": [512], "name": "module_apply_default/resnet_v2_50/block2/unit_4/bottleneck_v2/preact/FusedBatchNorm/Scaled"}, {"dtype": "float32", "shape": [512], "name": "module_apply_default/resnet_v2_50/block3/unit_1/bottleneck_v2/preact/FusedBatchNorm/Offset"}, {"dtype": "float32", "shape": [512], "name": "module_apply_default/resnet_v2_50/block3/unit_1/bottleneck_v2/preact/FusedBatchNorm/Scaled"}, {"dtype": "float32", "shape": [1024], "name": "module_apply_default/resnet_v2_50/block3/unit_2/bottleneck_v2/preact/FusedBatchNorm/Offset"}, {"dtype": "float32", "shape": [1024], "name": "module_apply_default/resnet_v2_50/block3/unit_2/bottleneck_v2/preact/FusedBatchNorm/Scaled"}, {"dtype": "float32", "shape": [1024], "name": "module_apply_default/resnet_v2_50/block3/unit_3/bottleneck_v2/preact/FusedBatchNorm/Offset"}, {"dtype": "float32", "shape": [1024], "name": "module_apply_default/resnet_v2_50/block3/unit_3/bottleneck_v2/preact/FusedBatchNorm/Scaled"}, {"dtype": "float32", "shape": [1024], "name": "module_apply_default/resnet_v2_50/block3/unit_4/bottleneck_v2/preact/FusedBatchNorm/Offset"}, {"dtype": "float32", "shape": [1024], "name": "module_apply_default/resnet_v2_50/block3/unit_4/bottleneck_v2/preact/FusedBatchNorm/Scaled"}, {"dtype": "float32", "shape": [1024], "name": "module_apply_default/resnet_v2_50/block3/unit_5/bottleneck_v2/preact/FusedBatchNorm/Offset"}, {"dtype": "float32", "shape": [1024], "name": "module_apply_default/resnet_v2_50/block3/unit_5/bottleneck_v2/preact/FusedBatchNorm/Scaled"}, {"dtype": "float32", "shape": [1024], "name": "module_apply_default/resnet_v2_50/block3/unit_6/bottleneck_v2/preact/FusedBatchNorm/Offset"}, {"dtype": "float32", "shape": [1024], "name": "module_apply_default/resnet_v2_50/block3/unit_6/bottleneck_v2/preact/FusedBatchNorm/Scaled"}, {"dtype": "float32", "shape": [1024], "name": "module_apply_default/resnet_v2_50/block4/unit_1/bottleneck_v2/preact/FusedBatchNorm/Offset"}, {"dtype": "float32", "shape": [1024], "name": "module_apply_default/resnet_v2_50/block4/unit_1/bottleneck_v2/preact/FusedBatchNorm/Scaled"}, {"dtype": "float32", "shape": [2048], "name": "module_apply_default/resnet_v2_50/block4/unit_2/bottleneck_v2/preact/FusedBatchNorm/Offset"}, {"dtype": "float32", "shape": [2048], "name": "module_apply_default/resnet_v2_50/block4/unit_2/bottleneck_v2/preact/FusedBatchNorm/Scaled"}, {"dtype": "float32", "shape": [2048], "name": "module_apply_default/resnet_v2_50/block4/unit_3/bottleneck_v2/preact/FusedBatchNorm/Offset"}, {"dtype": "float32", "shape": [2048], "name": "module_apply_default/resnet_v2_50/block4/unit_3/bottleneck_v2/preact/FusedBatchNorm/Scaled"}, {"dtype": "float32", "shape": [2048], "name": "module_apply_default/resnet_v2_50/postnorm/FusedBatchNorm/Offset"}, {"dtype": "float32", "shape": [2048], "name": "module_apply_default/resnet_v2_50/postnorm/FusedBatchNorm/Scaled"}]}], "modelTopology": {"node": [{"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "2048"}]}}}}, "name": "module/resnet_v2_50/block4/unit_1/bottleneck_v2/conv3/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}]}}}}, "name": "module/resnet_v2_50/block4/unit_1/bottleneck_v2/conv3/biases", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "1024"}]}}}}, "name": "module/resnet_v2_50/block3/unit_6/bottleneck_v2/conv3/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}}, "name": "module/resnet_v2_50/block3/unit_6/bottleneck_v2/conv3/biases", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "1024"}]}}}}, "name": "module/resnet_v2_50/block3/unit_1/bottleneck_v2/conv3/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}}, "name": "module/resnet_v2_50/block3/unit_1/bottleneck_v2/conv3/biases", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "512"}]}}}}, "name": "module/resnet_v2_50/block2/unit_4/bottleneck_v2/conv3/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}, "name": "module/resnet_v2_50/block2/unit_4/bottleneck_v2/conv3/biases", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "512"}]}}}}, "name": "module/resnet_v2_50/block2/unit_1/bottleneck_v2/conv3/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}, "name": "module/resnet_v2_50/block2/unit_1/bottleneck_v2/conv3/biases", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}}, "name": "module_apply_default/resnet_v2_50/block1/unit_3/bottleneck_v2/Pad/paddings", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "256"}]}}}}, "name": "module/resnet_v2_50/block1/unit_3/bottleneck_v2/conv3/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "module/resnet_v2_50/block1/unit_3/bottleneck_v2/conv3/biases", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "256"}]}}}}, "name": "module/resnet_v2_50/block1/unit_1/bottleneck_v2/conv3/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "module/resnet_v2_50/block1/unit_1/bottleneck_v2/conv3/biases", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}}, "name": "images", "op": "Placeholder"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}, "name": "module_apply_default/hub_input/Mul/y", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}, "name": "module_apply_default/hub_input/Sub/y", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}}, "name": "module_apply_default/resnet_v2_50/Pad/paddings", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "3"}, {"size": "64"}]}}}}, "name": "module/resnet_v2_50/conv1/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "module/resnet_v2_50/conv1/biases", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "256"}]}}}}, "name": "module/resnet_v2_50/block1/unit_1/bottleneck_v2/shortcut/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "module/resnet_v2_50/block1/unit_1/bottleneck_v2/shortcut/biases", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "256"}]}}}}, "name": "module/resnet_v2_50/block1/unit_2/bottleneck_v2/conv3/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "module/resnet_v2_50/block1/unit_2/bottleneck_v2/conv3/biases", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "512"}]}}}}, "name": "module/resnet_v2_50/block2/unit_1/bottleneck_v2/shortcut/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}, "name": "module/resnet_v2_50/block2/unit_1/bottleneck_v2/shortcut/biases", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "512"}]}}}}, "name": "module/resnet_v2_50/block2/unit_2/bottleneck_v2/conv3/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}, "name": "module/resnet_v2_50/block2/unit_2/bottleneck_v2/conv3/biases", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "512"}]}}}}, "name": "module/resnet_v2_50/block2/unit_3/bottleneck_v2/conv3/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}, "name": "module/resnet_v2_50/block2/unit_3/bottleneck_v2/conv3/biases", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "1024"}]}}}}, "name": "module/resnet_v2_50/block3/unit_1/bottleneck_v2/shortcut/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}}, "name": "module/resnet_v2_50/block3/unit_1/bottleneck_v2/shortcut/biases", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "1024"}]}}}}, "name": "module/resnet_v2_50/block3/unit_2/bottleneck_v2/conv3/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}}, "name": "module/resnet_v2_50/block3/unit_2/bottleneck_v2/conv3/biases", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "1024"}]}}}}, "name": "module/resnet_v2_50/block3/unit_3/bottleneck_v2/conv3/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}}, "name": "module/resnet_v2_50/block3/unit_3/bottleneck_v2/conv3/biases", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "1024"}]}}}}, "name": "module/resnet_v2_50/block3/unit_4/bottleneck_v2/conv3/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}}, "name": "module/resnet_v2_50/block3/unit_4/bottleneck_v2/conv3/biases", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "1024"}]}}}}, "name": "module/resnet_v2_50/block3/unit_5/bottleneck_v2/conv3/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}}, "name": "module/resnet_v2_50/block3/unit_5/bottleneck_v2/conv3/biases", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "2048"}]}}}}, "name": "module/resnet_v2_50/block4/unit_1/bottleneck_v2/shortcut/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}]}}}}, "name": "module/resnet_v2_50/block4/unit_1/bottleneck_v2/shortcut/biases", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "2048"}]}}}}, "name": "module/resnet_v2_50/block4/unit_2/bottleneck_v2/conv3/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}]}}}}, "name": "module/resnet_v2_50/block4/unit_2/bottleneck_v2/conv3/biases", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "2048"}]}}}}, "name": "module/resnet_v2_50/block4/unit_3/bottleneck_v2/conv3/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}]}}}}, "name": "module/resnet_v2_50/block4/unit_3/bottleneck_v2/conv3/biases", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}, "name": "module_apply_default/resnet_v2_50/pool5/reduction_indices", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "64"}]}}}}, "name": "module/resnet_v2_50/block1/unit_1/bottleneck_v2/conv1/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "module_apply_default/resnet_v2_50/block1/unit_1/bottleneck_v2/conv1/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}, "name": "module/resnet_v2_50/block1/unit_1/bottleneck_v2/conv2/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "module_apply_default/resnet_v2_50/block1/unit_1/bottleneck_v2/conv2/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "64"}]}}}}, "name": "module/resnet_v2_50/block1/unit_2/bottleneck_v2/conv1/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "module_apply_default/resnet_v2_50/block1/unit_2/bottleneck_v2/conv1/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}, "name": "module/resnet_v2_50/block1/unit_2/bottleneck_v2/conv2/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "module_apply_default/resnet_v2_50/block1/unit_2/bottleneck_v2/conv2/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "64"}]}}}}, "name": "module/resnet_v2_50/block1/unit_3/bottleneck_v2/conv1/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "module_apply_default/resnet_v2_50/block1/unit_3/bottleneck_v2/conv1/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}, "name": "module/resnet_v2_50/block1/unit_3/bottleneck_v2/conv2/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "module_apply_default/resnet_v2_50/block1/unit_3/bottleneck_v2/conv2/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "128"}]}}}}, "name": "module/resnet_v2_50/block2/unit_1/bottleneck_v2/conv1/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}, "name": "module_apply_default/resnet_v2_50/block2/unit_1/bottleneck_v2/conv1/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}, "name": "module/resnet_v2_50/block2/unit_1/bottleneck_v2/conv2/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}, "name": "module_apply_default/resnet_v2_50/block2/unit_1/bottleneck_v2/conv2/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "128"}]}}}}, "name": "module/resnet_v2_50/block2/unit_2/bottleneck_v2/conv1/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}, "name": "module_apply_default/resnet_v2_50/block2/unit_2/bottleneck_v2/conv1/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}, "name": "module/resnet_v2_50/block2/unit_2/bottleneck_v2/conv2/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}, "name": "module_apply_default/resnet_v2_50/block2/unit_2/bottleneck_v2/conv2/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "128"}]}}}}, "name": "module/resnet_v2_50/block2/unit_3/bottleneck_v2/conv1/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}, "name": "module_apply_default/resnet_v2_50/block2/unit_3/bottleneck_v2/conv1/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}, "name": "module/resnet_v2_50/block2/unit_3/bottleneck_v2/conv2/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}, "name": "module_apply_default/resnet_v2_50/block2/unit_3/bottleneck_v2/conv2/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "128"}]}}}}, "name": "module/resnet_v2_50/block2/unit_4/bottleneck_v2/conv1/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}, "name": "module_apply_default/resnet_v2_50/block2/unit_4/bottleneck_v2/conv1/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}, "name": "module/resnet_v2_50/block2/unit_4/bottleneck_v2/conv2/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}, "name": "module_apply_default/resnet_v2_50/block2/unit_4/bottleneck_v2/conv2/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "256"}]}}}}, "name": "module/resnet_v2_50/block3/unit_1/bottleneck_v2/conv1/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "module_apply_default/resnet_v2_50/block3/unit_1/bottleneck_v2/conv1/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}, "name": "module/resnet_v2_50/block3/unit_1/bottleneck_v2/conv2/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "module_apply_default/resnet_v2_50/block3/unit_1/bottleneck_v2/conv2/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "256"}]}}}}, "name": "module/resnet_v2_50/block3/unit_2/bottleneck_v2/conv1/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "module_apply_default/resnet_v2_50/block3/unit_2/bottleneck_v2/conv1/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}, "name": "module/resnet_v2_50/block3/unit_2/bottleneck_v2/conv2/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "module_apply_default/resnet_v2_50/block3/unit_2/bottleneck_v2/conv2/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "256"}]}}}}, "name": "module/resnet_v2_50/block3/unit_3/bottleneck_v2/conv1/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "module_apply_default/resnet_v2_50/block3/unit_3/bottleneck_v2/conv1/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}, "name": "module/resnet_v2_50/block3/unit_3/bottleneck_v2/conv2/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "module_apply_default/resnet_v2_50/block3/unit_3/bottleneck_v2/conv2/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "256"}]}}}}, "name": "module/resnet_v2_50/block3/unit_4/bottleneck_v2/conv1/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "module_apply_default/resnet_v2_50/block3/unit_4/bottleneck_v2/conv1/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}, "name": "module/resnet_v2_50/block3/unit_4/bottleneck_v2/conv2/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "module_apply_default/resnet_v2_50/block3/unit_4/bottleneck_v2/conv2/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "256"}]}}}}, "name": "module/resnet_v2_50/block3/unit_5/bottleneck_v2/conv1/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "module_apply_default/resnet_v2_50/block3/unit_5/bottleneck_v2/conv1/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}, "name": "module/resnet_v2_50/block3/unit_5/bottleneck_v2/conv2/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "module_apply_default/resnet_v2_50/block3/unit_5/bottleneck_v2/conv2/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "256"}]}}}}, "name": "module/resnet_v2_50/block3/unit_6/bottleneck_v2/conv1/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "module_apply_default/resnet_v2_50/block3/unit_6/bottleneck_v2/conv1/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}, "name": "module/resnet_v2_50/block3/unit_6/bottleneck_v2/conv2/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "module_apply_default/resnet_v2_50/block3/unit_6/bottleneck_v2/conv2/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "512"}]}}}}, "name": "module/resnet_v2_50/block4/unit_1/bottleneck_v2/conv1/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}, "name": "module_apply_default/resnet_v2_50/block4/unit_1/bottleneck_v2/conv1/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}}, "name": "module/resnet_v2_50/block4/unit_1/bottleneck_v2/conv2/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}, "name": "module_apply_default/resnet_v2_50/block4/unit_1/bottleneck_v2/conv2/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "2048"}, {"size": "512"}]}}}}, "name": "module/resnet_v2_50/block4/unit_2/bottleneck_v2/conv1/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}, "name": "module_apply_default/resnet_v2_50/block4/unit_2/bottleneck_v2/conv1/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}}, "name": "module/resnet_v2_50/block4/unit_2/bottleneck_v2/conv2/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}, "name": "module_apply_default/resnet_v2_50/block4/unit_2/bottleneck_v2/conv2/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "2048"}, {"size": "512"}]}}}}, "name": "module/resnet_v2_50/block4/unit_3/bottleneck_v2/conv1/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}, "name": "module_apply_default/resnet_v2_50/block4/unit_3/bottleneck_v2/conv1/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}}, "name": "module/resnet_v2_50/block4/unit_3/bottleneck_v2/conv2/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}, "name": "module_apply_default/resnet_v2_50/block4/unit_3/bottleneck_v2/conv2/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "module_apply_default/resnet_v2_50/block1/unit_1/bottleneck_v2/preact/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "module_apply_default/resnet_v2_50/block1/unit_1/bottleneck_v2/preact/FusedBatchNorm/Scaled", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "module_apply_default/resnet_v2_50/block1/unit_2/bottleneck_v2/preact/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "module_apply_default/resnet_v2_50/block1/unit_2/bottleneck_v2/preact/FusedBatchNorm/Scaled", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "module_apply_default/resnet_v2_50/block1/unit_3/bottleneck_v2/preact/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "module_apply_default/resnet_v2_50/block1/unit_3/bottleneck_v2/preact/FusedBatchNorm/Scaled", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "module_apply_default/resnet_v2_50/block2/unit_1/bottleneck_v2/preact/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "module_apply_default/resnet_v2_50/block2/unit_1/bottleneck_v2/preact/FusedBatchNorm/Scaled", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}, "name": "module_apply_default/resnet_v2_50/block2/unit_2/bottleneck_v2/preact/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}, "name": "module_apply_default/resnet_v2_50/block2/unit_2/bottleneck_v2/preact/FusedBatchNorm/Scaled", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}, "name": "module_apply_default/resnet_v2_50/block2/unit_3/bottleneck_v2/preact/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}, "name": "module_apply_default/resnet_v2_50/block2/unit_3/bottleneck_v2/preact/FusedBatchNorm/Scaled", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}, "name": "module_apply_default/resnet_v2_50/block2/unit_4/bottleneck_v2/preact/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}, "name": "module_apply_default/resnet_v2_50/block2/unit_4/bottleneck_v2/preact/FusedBatchNorm/Scaled", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}, "name": 